app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 ORDER BY projects.created_at DESC LIMIT 1  [["id", "1"]]
---
  def show
    @project = Project.find(params[:id])

INSERT INTO "projects" ("content", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @project = current_user.projects.build(project_params)
    if @project.save