app/controllers/users_controller.rb

  def new
    if !User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1

  def show
    # this is the case when someone goes to /dashboard, so we'll want to display the user's projects and blogs
    # if params[:id] == -1
      @user = current_user
      @projects = @user.projects.paginate(page: params[:page], :per_page => 10)
      @blogs = @user.blogs.paginate(page: params[:page], :per_page => 10)
      @custompages = @user.custompages.paginate(page: params[:page], :per_page => 10)
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 ORDER BY projects.created_at DESC LIMIT 10 OFFSET 0  [["user_id", 1]]
SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = $1 ORDER BY blogs.created_at DESC LIMIT 10 OFFSET 0  [["user_id", 1]]
SELECT "custompages".* FROM "custompages" WHERE "custompages"."user_id" = $1 ORDER BY custompages.created_at DESC LIMIT 10 OFFSET 0  [["user_id", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("auth_token", "created_at", "email", "name", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"