app/views/layouts/_header.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
---
          <li><%= link_to "About", about_path %></li>
          <% if User.first %>

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 ORDER BY projects.created_at DESC  [["user_id", 1]]
---
  	          <ul class="dropdown-menu">
                <% User.first.projects.each do |project| %>